Revit 2027 API
StructuralConnectionHandler.GetInputReferences Method
 Gets references of input elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> GetInputReferences()
Public Function GetInputReferences As IList(Of Reference)
public:
IList<Reference^>^ GetInputReferences()
member GetInputReferences : unit -> IList<Reference>
Return Value
IList<Reference>
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace